app/controllers/admin/permissions_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @ability = Ability.new(@user)
    @projects = Project.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."user_id" = 2
INSERT INTO "permissions" ("action", "created_at", "thing_id", "thing_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["action", "view"], ["created_at", Mon, 09 Jul 2012 10:59:40 UTC +00:00], ["thing_id", 2], ["thing_type", "Project"], ["updated_at", Mon, 09 Jul 2012 10:59:40 UTC +00:00], ["user_id", 2]]
---
  def update
    @user.permissions.clear
	if !params[:permissions].blank?
    params[:permissions].each do |id, permissions|
      project = Project.find(id)
      permissions.each do |permission, checked|
        Permission.create!(:user => @user,
                           :thing => project,
                           :action => permission)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def find_user
    @user = User.find(params[:user_id])